Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.SetAssociationsChanged
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAssociatedElementIds(Autodesk.Revit.DB.ElementId)
Returns ids of the elements which are in association with the element with the given ElementId.
elementId:
Element id for which we want to get the associated elements.
Returns:
Ids of the associated elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAssociatedElementId(Autodesk.Revit.DB.ElementId)
Returns id of the element which is in association with the element with the given ElementId.
elementId:
Element id for which we want to get the associated element.
Returns:
Id of the associated element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.RemoveAssociation(Autodesk.Revit.DB.ElementId)
This method will remove the association for the element with the given ElementId.
Remarks:
If the id does not have any association, an exception is thrown.
id:
Id of the element for which we want to remove the association.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This element doesn't have an association defined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.AddAssociation(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Adds a new association between a group of analytical elements and a group of physical elements.
Remarks:
The arguments must be ids of analytical and of physical elements that don't have other associations, otherwise an exception is thrown.
Physical elements can have one of these categories:
Columns Curtain Wall Panels Floors Generic Models Mass Parts Railings Ramps Roofs Stairs Structural Columns Structural Foundation Structural Framing Structural Trusses Structural Beam System Walls
Analytical elements can have one of these categories:
Analytical Member Analytical Panel
analyticalElementIds:
Ids of the analytical elements.
physicalElementIds:
Ids of the physical elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Analytical id is not valid or has already defined another association.
-or-
Physical id is not valid or has already defined another association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.AddAssociation(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Adds a new association between an analytical element and a physical element.
Remarks:
The arguments must be ids of an analytical and of a physical element that don't have other associations, otherwise an exception is thrown.
Physical element can have one of these categories:
Columns Curtain Wall Panels Floors Generic Models Mass Parts Railings Ramps Roofs Stairs Structural Columns Structural Foundation Structural Framing Structural Trusses Structural Beam System Walls
Analytical element can have one of these categories:
Analytical Member Analytical Panel
analyticalElementId:
Id of the analytical element.
physicalElementId:
Id of the physical element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Analytical id is not valid or has already defined another association.
-or-
Physical id is not valid or has already defined another association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.IsPhysicalElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if the element is a physical element.
doc:
Revit document.
id:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.IsAnalyticalElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if the element is an analytical element.
doc:
Revit document.
id:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.HasAssociation(Autodesk.Revit.DB.ElementId)
Verifies if the element has already defined an association.
id:
Id of the element to check.
Returns:
Returns true if an association has been found, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager(Autodesk.Revit.DB.Document)
Returns the AnalyticalToPhysicalAssociationManager for this document.
doc:
Revit document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.EnableAssistedAssociation
Indicates if associations between Analytical and Physical Elements should be created automatically.
Remarks:
If this flag is set to true, the associations are made on creation of an analytical element over a physical element.
If it's set to false, then the associations between analytical and physical elements have to be made manually.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
Class which manages the associations between analytical elements and physical elements.
Remarks:
An element can be part of only one association at a time.
Physical elements can have one of these categories:
Columns Curtain Wall Panels Floors Generic Models Mass Parts Railings Ramps Roofs Stairs Structural Columns Structural Foundation Structural Framing Structural Trusses Structural Beam System Walls
Analytical elements can have one of these categories:
Analytical Member Analytical Panel
Since:
2023